# Transactions

In this Notebook, you will learn about how PostgeSQL supports transactions.

Enable access to the PostgreSQL database engine via [SQL Cell Magic](https://pypi.python.org/pypi/ipython-sql).

In [1]:
%load_ext sql
%sql postgresql://test:test@localhost:5432/tm351test

'Connected: test@tm351test'

As the `doctor` and `patient` tables may have been updated by another Notebook, recreate them.

In [2]:
%%sql
DROP TABLE IF EXISTS patient CASCADE;
DROP TABLE IF EXISTS doctor CASCADE;

CREATE TABLE doctor (
 doctor_id CHAR(3) NOT NULL
  CHECK (doctor_id SIMILAR TO 'd[0-9][0-9]'),
 doctor_name VARCHAR(20) NOT NULL,
 date_of_birth DATE NOT NULL,
 PRIMARY KEY (doctor_id)
 );

CREATE TABLE patient (
  patient_id CHAR(4) NOT NULL
    CHECK (patient_id SIMILAR TO 'p[0-9][0-9][0-9]'),
  patient_name VARCHAR(20) NOT NULL,
  date_of_birth DATE NOT NULL,
  gender CHAR(1) NOT NULL
    CHECK (gender = 'F' OR gender = 'M'),
  height DECIMAL(4,1)
    CHECK (height > 0),
  weight DECIMAL(4,1)
    CHECK (weight > 0),
  doctor_id CHAR(3),
 PRIMARY KEY (patient_id),
 FOREIGN KEY (doctor_id) REFERENCES doctor(doctor_id)
 );

Done.
Done.
Done.
Done.

[]

Populate the tables from files using [Psycopg](http://initd.org/psycopg/docs/index.html), 
a PostgreSQL database adapter for Python.

In [3]:
import psycopg2 as pg
import pandas as pd
import pandas.io.sql as psqlg

In [4]:
# open a connection to the PostgreSQL database tm351test
conn = pg.connect(dbname='tm351test', host='localhost', user='test', password='test', port=5432)
# create a cursor
c = conn.cursor()

# open doctor.dat
io = open('data/doctor.dat', 'r')
# execute the PostgreSQL copy command
c.copy_from(io, 'doctor')
# close doctor.dat
io.close()
# commit transaction
conn.commit()

# open patient+doctor_id.dat
io = open('data/patient+doctor_id.dat', 'r')
# execute the PostgreSQL copy command
c.copy_from(io, 'patient')
# close patient+doctor_id.dat
io.close()
# commit transaction
conn.commit()

In [5]:
%%sql
SELECT * 
FROM doctor
ORDER BY doctor_id;

5 rows affected.

[('d06', 'Gibson', datetime.date(1954, 2, 24)),
 ('d07', 'Paxton', datetime.date(1960, 5, 23)),
 ('d09', 'Tamblin', datetime.date(1972, 12, 22)),
 ('d10', 'Rampton', datetime.date(1980, 9, 25)),
 ('d11', 'Nolan', datetime.date(1988, 4, 1))]

In [7]:
%%sql
SELECT * 
FROM patient
ORDER BY patient_id
LIMIT 5;

5 rows affected.

[('p001', 'Thornton', datetime.date(1980, 1, 22), 'F', Decimal('162.3'), Decimal('71.6'), 'd06'),
 ('p007', 'Tennent', datetime.date(1980, 4, 1), 'M', Decimal('176.8'), Decimal('70.9'), 'd07'),
 ('p008', 'James', datetime.date(1980, 7, 8), 'M', Decimal('167.9'), Decimal('70.5'), 'd07'),
 ('p009', 'Kay', datetime.date(1980, 9, 25), 'F', Decimal('164.7'), Decimal('53.2'), 'd06'),
 ('p015', 'Harris', datetime.date(1980, 12, 4), 'M', Decimal('180.6'), Decimal('64.3'), 'd06')]

In PostgreSQL, a transaction is set up by surrounding the SQL commands of the transaction with `BEGIN` and `COMMIT` commands.

If, partway through the transaction, we decide we do not want to commit, we can issue the command `ROLLBACK` instead of `COMMIT`, and all our updates so far will be cancelled.

PostgreSQL actually treats every SQL statement as being executed within a transaction. 
If you do not issue a `BEGIN` command, then each individual statement has an implicit `BEGIN` and (if successful) `COMMIT` wrapped around it. 

A group of statements surrounded by `BEGIN` and `COMMIT` is a transaction which must either succeed completely, or fail without causing any change to the database.

The following SQL statements illustrate the use of the `BEGIN`, `COMMIT` and `ROLLBACK` commands within a transaction.

Because SQL cell magic does not always handle failing transactions properly, we will use Psycopg 
(a PostgreSQL database adapter for Python) for transactions.

The following sequence of SQL statements initiates a transaction, adds 2 rows to the `doctor` table, but then cancels the transaction.

In [ ]:
c.execute("BEGIN");
c.execute("INSERT INTO doctor (doctor_id, doctor_name, date_of_birth) VALUES('d12','Solent','1962-12-26')");
c.execute("INSERT INTO doctor (doctor_id, doctor_name, date_of_birth) VALUES('d13','Malakite','1976-04-08')");
c.execute("ROLLBACK");

In [ ]:
%%sql
SELECT * 
FROM doctor
ORDER BY doctor_id;

The following sequence of SQL statements initiates a transaction, adds 2 rows to the `doctor` table, and then commits the transaction.

In [ ]:
c.execute("BEGIN");
c.execute("INSERT INTO doctor (doctor_id, doctor_name, date_of_birth) VALUES('d12','Solent','1962-12-26')");
c.execute("INSERT INTO doctor (doctor_id, doctor_name, date_of_birth) VALUES('d13','Malakite','1976-04-08')");
c.execute("COMMIT");

In [ ]:
%%sql
SELECT * 
FROM doctor
ORDER BY doctor_id;

The following sequence of SQL statements initiates a transaction, adds a row to the `doctor` table, and then tries to add a row to the `patient` table, but this fails because it would violate referential integrity (`patient.doctor_id` is `d15` rather than `d14`).

In [ ]:
c.execute("BEGIN")
c.execute("INSERT INTO doctor (doctor_id, doctor_name, date_of_birth) VALUES('d14','Otter','1967-07-21')");
c.execute("INSERT INTO patient (patient_id, patient_name, date_of_birth, gender, height, weight, doctor_id) \
           VALUES ('p091','Torp','1978-12-02','F',172.9,53.4,'d15')");
c.execute("COMMIT");

The transaction has failed and any changes to the database have been cancelled (see below), but the transaction 
is incomplete and it is waiting for a response from the user/application.

If we attempt to continue to update the database we will receive the following message:
    
    Current transaction is aborted, commands ignored until end of transaction block

We can terminate the transaction by issuing either a `COMMIT` or `ROLLBACK`, both commands have the same effect as the transaction has failed and any changes to the database have been cancelled.

In [ ]:
c.execute("COMMIT");

In [ ]:
%%sql
SELECT * 
FROM doctor
ORDER BY doctor_id;

In [ ]:
%%sql
SELECT * 
FROM patient
ORDER BY patient_id;

Correct the above SQL statements by changing `patient.doctor_id` from `d15` to `d14`, and retry.

In [ ]:
c.execute("BEGIN")
c.execute("INSERT INTO doctor (doctor_id, doctor_name, date_of_birth) VALUES('d14','Otter','1967-07-21')");
c.execute("INSERT INTO patient (patient_id, patient_name, date_of_birth, gender, height, weight, doctor_id) \
           VALUES ('p091','Torp','1978-12-02','F',172.9,53.4,'d14')");
c.execute("COMMIT");

In [ ]:
%%sql
SELECT * 
FROM doctor
ORDER BY doctor_id;

In [ ]:
%%sql
SELECT * 
FROM patient
ORDER BY patient_id;

## Summary
In this Notebook you have seen how PostgeSQL supports transactions.

## What next?
If you are working through this Notebook as part of an inline exercise, return to the module materials now.

If you are working through this set of Notebooks as a whole, move on to `12.2 Indexing`.